---
title: WallType
classe: Autodesk.Revit.DB.WallType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObjAttributes
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# WallType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WallFunction Function { get; set; }` | `wallType.Function` | WallFunction |
| `WallKind Kind { get; }` | `wallType.Kind` | WallKind |
| `ThermalProperties ThermalProperties { get; }` | `wallType.ThermalProperties` | ThermalProperties |
| `Double Width { get; }` | `wallType.Width` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```